-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 09, 2023 at 05:38 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `thaiherb`
--

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `pro_id` int(5) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสสินค้า',
  `pro_name` varchar(30) NOT NULL COMMENT 'ชื่อสินค้า',
  `detail` text NOT NULL COMMENT 'รายละเอียด',
  `price` int(5) NOT NULL COMMENT 'ราคาสินค้า',
  `amount` float NOT NULL COMMENT 'จำนวนสินค้าคงเหลือ',
  `image` varchar(50) NOT NULL COMMENT 'รูปสินค้า',
  `type` varchar(60) NOT NULL COMMENT 'ชนิด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`pro_id`, `pro_name`, `detail`, `price`, `amount`, `image`, `type`) VALUES
(00001, 'กำลังช้างสาร', '✅บำรุงร่างกายผู้ชายให้ แข็ง แรง ไม่ อ่อน เพลีย\r\n✅บำรุงฮอร์โมน ชายให้สมบูรณ์\r\n✅กระตุ้นการสูบฉีดไหลเวียนของเลือด \r\n✅ลดการเมื่อยเหนื่อยล้า\r\n✅บำรุงระบบช่วงล่างของผู้ชาย\r\n✅เสริมฮอร์โมนสำหรับ ผชที่อายุมากขึ้น', 350, 17, 'a1.jpg', 'ชนิดแคปซูล'),
(00002, 'แก้ปวดเมื่อย', '✅ช่วยบรรเทาอาการปวดเมื่อย \r\n✅ปวดกล้ามเนื้อบริเวณต่าง ๆ ปวดหลัง ปวดเอว ปวดข้อ ปวดกระดูก \r\n✅แก้กษัยเส้น แก้เส้นยึด เส้นตึง  กล้ามเนื้ออักเสบ กล้ามเนื้ออ่อนแรง ชาตามมือ ชาตามเท้า \r\n✅บำรุงเส้นเอ็น กล้ามเนื้อ กระดูกและข้อให้แข็งแรง ✅อีกทั้งช่วยบำรุงโลหิต บำรุงธาตุ และบำรุงร่างกายให้แข็งแรงทำให้สดชื่น กระปรี้กระเปร่ายิ่งขึ้น', 350, 5, 'a2.jpg', 'ชนิดแคปซูล'),
(00003, 'รากสามสิบ', 'ช่วยในเรื่อง......\r\n✅ปรับสมดุลร่างกาย\r\n✅ปวดประจำเดือน มาไม่ปกติ\r\n✅คัน ตกขาว มีกลิ่น\r\n✅ผิวพรรณสดใส\r\n✅บำรุงภายใน', 350, 15, 'a3.jpg', 'ชนิดแคปซูล'),
(00004, 'ริดสีดวงทวาร', '✅อึง่ายถ่ายคล่อง อึนุ่ม ไม่บาด  ไม่แปล๊บรู \r\n✅ก้อนเนื้อช่วงล่างเล็กลง นั่งง่าย เดินสบาย \r\n✅ป้องกันขยายของหลอดเลือด ช่วงล่าง ไม่ให้เป็นก้อนเนื้อ \r\n✅ลดความแสบ แปล๊บๆ เมื่อขับถ่าย \r\n✅สมานรอยแตก ของก้อนเนื้อภาย ไม่ให้มีเลือด', 350, 5, 'a4.jpg', 'ชนิดแคปซูล'),
(00005, 'พลูคาว', '✅ช่วยให้มดลูกแข็งแรง \r\n✅ช่วยบำรุงสำหรับผู้หญิงหลังคลอดบำรุงน้ำนมได้ดีมาก \r\n✅ช่องคลอดฟิตกระชับ กลิ่นอับกลิ่นชื้นหาย \r\n✅แก้ปวดประจำเดือน ช่วยปรับฮอร์โมน ลดอาการวัยทอง ลดตกขาวลดกลิ่น มดลูกแข็งแรง ลดอาการปวดผิดปกติต่างๆ \r\n✅สำหรับผู้หญิงโดยตรง มีส่วนผสมของเปลือกตะโกนา เกล็ดสะระแหน่ โกฐหัวบัว รากสามสิบ หัวกาวเครือขาว เป็นสูตรสมุนไพรเพิ่มน้ำนมด้วย', 350, 8, 'a5.jpg', 'ชนิดแคปซูล'),
(00006, 'ระบาย', '✅กระตุ้นระบบขับถ่าย ขับเมือกมัน ไม่สะสม\r\n✅อึง่าย ไม่มวลท้อง ไม่ต้องนั่งนาน\r\n✅ขับลมในลำไส้ ลดการท้องป่อง ใส่เสื้อง่าย\r\n✅ระบาย อาหารมื้อหนักที่กินมา', 350, 8, 'a6.jpg', 'ชนิดแคปซูล'),
(00007, 'ขมิ้นชัน', '✅ช่วยลดอาการแน่นท้อง\r\n✅จุกเสียด', 350, 7, 'a7.jpg', 'ชนิดแคปซูล'),
(00008, 'ฟ้าทะลายโจร', '✅แก้ไข้\r\n✅แก้ร้อนใน\r\n✅แก้กระหายน้ำ', 350, 9, 'a8.jpg', 'ชนิดแคปซูล'),
(00009, 'กระชายขาว', '✅บำรุงร่างกาย \r\n✅เสริมภูมิคุ้มกัน \r\n✅ย่อยอาหาร \r\n✅ขับลม', 350, 8, 'a9.png', 'ชนิดแคปซูล'),
(00010, 'ยาน้ำกษัยเส้น', '✅ช่วยแก้อาการปวดกล้ามเนื้อ ปวดหลัง ปวดเอว ปวดข้อ ปวดกระดูก ตะคริว นิ้วล็อค แก้กษัยเส้น เส้นยึด เส้นตึง เก๊าท์ กล้ามเนื้ออักเสบ กล้ามเนื้ออ่อนแรง ชาตามมือตามเท้า บำรุงกล้ามเนื้อและเอ็นให้แข็งแรง ', 220, 6, 'B1.png', 'ชนิดน้ำ'),
(00011, 'ยาน้ำกำลังช้างสาร', '✅บำรุงร่างกาย บำรุงกำลัง \r\n✅ช่วยให้ไม่เหนื่อยง่าย เสริมการออกกำลังกาย สร้างกล้ามเนื้อ \r\n✅ช่วยให้ออกกำลังกายได้นานยิ่งขึ้น ไม่ปวดปัสสาวะง่าย ไม่แสบขัด \r\n✅ สมุนไพรดีๆ สำหรับผู้ชาย ', 350, 7, 'B2.png', 'ชนิดน้ำ'),
(00012, 'ยาน้ำกุมาร', '✅ แก้เด็กเป็นตานขโมย ขับพยาธิ\r\n✅ เจริญอาหาร สำหรับเด็กตัวเล็ก ทานข้าวยาก\r\n✅ กินเก่งแต่ไม่อ้วน\r\n✅ หลับไม่สนิท หงุดหงิดงอแง\r\n✅ เหงื่อท่วมตัวหัวเหม็นคาว\r\n✅ เป็นหวัดเรื้อรัง\r\n✅ ภูมิแพ้ ผดผื่นคัน\r\n✅ ถ่ายยาก ท้องผูก ถ่ายเป็นเม็ดกระสุน\r\n✅ G6PD ทานได้\r\n✅ ผู้ใหญ่ก็สามารถทานได้', 220, 10, 'B3.png', 'ชนิดน้ำ'),
(00014, 'ยาน้ำรากสามสิบ', '• บำรุงโลหิตสำหรับผู้หญิง \r\n• เสริมฮอร์โมนเพศหญิง\r\n• รักษาอาการประจำเดือนมาไม่ปกติ\r\n• บรรเทาอาการปวดท้องก่อนมีรอบเดือน\r\n• บำรุงผิวพรรณให้กระจ่างใส', 220, 10, 'B4.png', 'ชนิดน้ำ'),
(00015, 'ยาแก้ไอ', 'บรรเทาอาการไอ \r\nขับเสมหะ \r\nและช่วยให้ชุ่มคอ', 220, 10, 'B5.png', 'ชนิดน้ำ'),
(00016, 'ยาน้ำดองมะกรูด', 'บำรุงโลหิต\r\n แก้ประจำเดือนมาไม่ปกติ\r\n ช่วยขับน้ำคาวปลา\r\n ชักมดลูกเข้าอู่', 590, 10, 'B6.jpg', 'ชนิดน้ำ'),
(00017, 'ยาน้ำว่านชักมมดลูก', 'บำรุงโลหิต แก้ประจำเดือนมาไม่ปกติ ช่วยขับน้ำคาวปลา ชักมดลูกเข้าอู่', 220, 9, 'B10.jpg', 'ชนิดน้ำ'),
(00018, 'ชาฝันหวาน', 'ช่วยให้ผ่อนคลาย หลับสบาย', 350, 13, 'B8.png', 'ชนิดน้ำ'),
(00019, 'ยาน้ำพลูคาว', 'บรรเทาอาการน้ำเหลืองเสีย', 350, 4, 'B9.png', 'ชนิดน้ำ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`pro_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `pro_id` int(5) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT 'รหัสสินค้า', AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
