-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 09, 2023 at 05:38 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `thaiherb`
--

-- --------------------------------------------------------

--
-- Table structure for table `table_order`
--

CREATE TABLE `table_order` (
  `orderID` int(5) UNSIGNED ZEROFILL NOT NULL COMMENT 'เลขที่ใบสั่งซื้อ',
  `cus_name` varchar(60) NOT NULL COMMENT 'ชื่อลูกค้า',
  `address` text NOT NULL COMMENT 'ที่อยู่',
  `telephone` varchar(10) NOT NULL COMMENT 'เบอร์โทรศัพท์',
  `total_price` float NOT NULL COMMENT 'ราคารวมสุทธิ',
  `order_status` varchar(1) NOT NULL COMMENT 'สถานะ\r\n0 = ยกเลิกการสั่งซื้อ  \r\n1 = ยังไม่ชำระเงิน \r\n2=  ชำระเงินเเล้ว',
  `reg_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT 'วันที่ส่งซื้อ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `table_order`
--

INSERT INTO `table_order` (`orderID`, `cus_name`, `address`, `telephone`, `total_price`, `order_status`, `reg_date`) VALUES
(00001, 'พัชรินทร์ ศิริหงษ์', '999', '0987654321', 0, '2', '2023-08-18 11:34:01'),
(00002, 'พัชรินทร์ ศิริหงษ์', '999', '0987654321', 0, '2', '2023-08-18 11:33:53'),
(00003, 'พัชรินทร์ ศิริหงษ์', '999', '0987654321', 0, '0', '2023-08-18 11:35:02'),
(00004, 'พัชรินทร์ ศิริหงษ์', '999', '0987654321', 0, '0', '2023-08-18 11:35:02'),
(00005, 'พัชรินทร์ ศิริหงษ์', '999', '0987654321', 0, '2', '2023-09-02 21:54:58'),
(00014, 'พัชรินทร์ ศิริหงษ์', '1111111111', '0988563254', 0, '1', '2023-08-18 11:33:08'),
(00015, 'พัชรินทร์ ศิริหงษ์', '1111111111', '0988563254', 0, '0', '2023-08-18 11:35:02'),
(00027, 'พัชรินทร์ ศิริหงษ์', '123333333', '0987654321', 0, '2', '2023-08-18 11:34:29'),
(00028, 'pat siri', '123', '0999325469', 1111, '2', '2023-08-18 11:34:04'),
(00029, 'patcharin sirihong', '111111', '0988563254', 0, '2', '2023-08-18 11:33:57'),
(00030, 'พัชรินทร์ ศิริหงษ์', '1111', '0985455655', 0, '2', '2023-08-18 11:34:08'),
(00031, 'patcharin sirihong', '156 / 1', '0985321654', 0, '2', '2023-08-18 11:33:36'),
(00032, 'pppat', '3333/8', '0986532417', 0, '2', '2023-08-18 11:33:42'),
(00033, 'สรสวรรค์ ', '888/8 สัตหีบ ชลบุรี ', '0985455462', 0, '2', '2023-08-18 11:33:31'),
(00034, 'ประสิทธิ์', '77/2', '0986521463', 0, '2', '2023-08-20 14:53:21'),
(00035, 'faaaaaaaaaaaa', '123/20', '0954625876', 0, '1', '2023-09-09 15:32:16'),
(00036, 'พัชรินทร์ ศิริหงษ์', '33', '0225555555', 0, '1', '2023-09-09 15:32:16'),
(00037, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00038, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00039, 'กกกกกกกกกก', '1111', '0985455858', 0, '1', '2023-09-09 15:32:16'),
(00040, 'กกกกกกกกกก', '1111', '0985455858', 0, '1', '2023-09-09 15:32:16'),
(00041, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00042, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00043, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00044, '', '', '', 0, '1', '2023-09-09 15:32:16'),
(00045, 'พัชรินทร์ ศิริหงษ์', '1235', '0988545624', 0, '', '2023-08-30 08:35:41'),
(00046, 'กกกกกกกกกก', '00', '', 0, '', '2023-08-30 08:36:11'),
(00047, '', '', '', 0, '', '2023-08-30 08:39:52'),
(00048, '', '', '', 0, '', '2023-08-30 08:41:50'),
(00049, '', '', '', 0, '', '2023-08-30 09:28:39'),
(00050, 'พัชรินทร์ ศิริหงษ์', '3333', '', 0, '', '2023-08-30 09:29:22'),
(00051, '', '', '', 0, '', '2023-08-30 09:30:00'),
(00052, '', '', '', 0, '', '2023-08-30 09:36:01'),
(00053, '', '', '', 0, '', '2023-08-30 09:54:44'),
(00054, '', '', '', 0, '', '2023-08-30 09:57:09'),
(00055, '', '', '', 0, '', '2023-08-30 09:57:38'),
(00056, '', '', '', 0, '', '2023-08-30 10:00:24'),
(00057, '', '', '', 0, '', '2023-08-30 10:01:04'),
(00058, '', '', '', 0, '', '2023-08-30 10:34:17'),
(00059, '', '', '', 0, '', '2023-08-30 10:44:15'),
(00060, '', '', '', 0, '', '2023-08-30 10:44:28'),
(00061, '', '', '', 0, '', '2023-09-02 13:28:10'),
(00062, 'พัชรินทร์ ศิริหงษ์', '', '', 0, '', '2023-09-02 13:40:26'),
(00063, 'pat siri', '22', '', 0, '', '2023-09-02 13:43:43'),
(00064, 'patcharin sirihong', '33', '0326464464', 0, '', '2023-09-02 13:50:01'),
(00065, '', '', '', 0, '', '2023-09-02 15:13:23'),
(00066, 'พัชรินทร์ ศิริหงษ์', '193', '0954325122', 0, '', '2023-09-02 20:18:38'),
(00067, '', '', '', 0, '', '2023-09-02 20:23:33'),
(00068, '', '', '', 0, '', '2023-09-02 20:24:06'),
(00069, '', '', '', 0, '', '2023-09-02 21:22:26'),
(00070, '', '', '', 0, '', '2023-09-09 15:29:24'),
(00071, 'kkkk', '11010', '0985465255', 0, '', '2023-09-09 15:30:56');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `table_order`
--
ALTER TABLE `table_order`
  ADD PRIMARY KEY (`orderID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `table_order`
--
ALTER TABLE `table_order`
  MODIFY `orderID` int(5) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT 'เลขที่ใบสั่งซื้อ', AUTO_INCREMENT=72;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
